Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxPms_bf.h
/** \brief Offset for Ifx_PMS_MONCTRL_Bits.SLCK */
#define IFX_PMS_MONCTRL_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_MONFILT_Bits.EVRCFIL */
#define IFX_PMS_MONFILT_EVRCFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_MONFILT_Bits.EVRCFIL */
#define IFX_PMS_MONFILT_EVRCFIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_MONFILT_Bits.EVRCFIL */
#define IFX_PMS_MONFILT_EVRCFIL_OFF (0u)

/** \brief Length for Ifx_PMS_MONFILT_Bits.PREFIL */
#define IFX_PMS_MONFILT_PREFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_MONFILT_Bits.PREFIL */
#define IFX_PMS_MONFILT_PREFIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_MONFILT_Bits.PREFIL */
#define IFX_PMS_MONFILT_PREFIL_OFF (4u)

/** \brief Length for Ifx_PMS_MONFILT_Bits.EVR33FIL */
#define IFX_PMS_MONFILT_EVR33FIL_LEN (4u)

/** \brief Mask for Ifx_PMS_MONFILT_Bits.EVR33FIL */
#define IFX_PMS_MONFILT_EVR33FIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_MONFILT_Bits.EVR33FIL */
#define IFX_PMS_MONFILT_EVR33FIL_OFF (8u)

/** \brief Length for Ifx_PMS_MONFILT_Bits.VDDMFIL */
#define IFX_PMS_MONFILT_VDDMFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_MONFILT_Bits.VDDMFIL */
#define IFX_PMS_MONFILT_VDDMFIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_MONFILT_Bits.VDDMFIL */
#define IFX_PMS_MONFILT_VDDMFIL_OFF (12u)

/** \brief Length for Ifx_PMS_MONFILT_Bits.SWDFIL */
#define IFX_PMS_MONFILT_SWDFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_MONFILT_Bits.SWDFIL */
#define IFX_PMS_MONFILT_SWDFIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_MONFILT_Bits.SWDFIL */
#define IFX_PMS_MONFILT_SWDFIL_OFF (16u)

/** \brief Length for Ifx_PMS_MONFILT_Bits.SBFIL */
#define IFX_PMS_MONFILT_SBFIL_LEN (4u)

/** \brief Mask for Ifx_PMS_MONFILT_Bits.SBFIL */
#define IFX_PMS_MONFILT_SBFIL_MSK (0xfu)

/** \brief Offset for Ifx_PMS_MONFILT_Bits.SBFIL */
#define IFX_PMS_MONFILT_SBFIL_OFF (20u)

/** \brief Length for Ifx_PMS_MONFILT_Bits.CLRFIL */
#define IFX_PMS_MONFILT_CLRFIL_LEN (1u)

/** \brief Mask for Ifx_PMS_MONFILT_Bits.CLRFIL */
#define IFX_PMS_MONFILT_CLRFIL_MSK (0x1u)

/** \brief Offset for Ifx_PMS_MONFILT_Bits.CLRFIL */
#define IFX_PMS_MONFILT_CLRFIL_OFF (29u)

/** \brief Length for Ifx_PMS_MONFILT_Bits.SLCK */
#define IFX_PMS_MONFILT_SLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_MONFILT_Bits.SLCK */
#define IFX_PMS_MONFILT_SLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_MONFILT_Bits.SLCK */
#define IFX_PMS_MONFILT_SLCK_OFF (30u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.OVSWD */
#define IFX_PMS_PMSIEN_OVSWD_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.OVSWD */
#define IFX_PMS_PMSIEN_OVSWD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.OVSWD */
#define IFX_PMS_PMSIEN_OVSWD_OFF (0u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.UVSWD */
#define IFX_PMS_PMSIEN_UVSWD_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.UVSWD */
#define IFX_PMS_PMSIEN_UVSWD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.UVSWD */
#define IFX_PMS_PMSIEN_UVSWD_OFF (1u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.OV33 */
#define IFX_PMS_PMSIEN_OV33_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.OV33 */
#define IFX_PMS_PMSIEN_OV33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.OV33 */
#define IFX_PMS_PMSIEN_OV33_OFF (2u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.UV33 */
#define IFX_PMS_PMSIEN_UV33_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.UV33 */
#define IFX_PMS_PMSIEN_UV33_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.UV33 */
#define IFX_PMS_PMSIEN_UV33_OFF (3u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.OVC */
#define IFX_PMS_PMSIEN_OVC_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.OVC */
#define IFX_PMS_PMSIEN_OVC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.OVC */
#define IFX_PMS_PMSIEN_OVC_OFF (4u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.UVC */
#define IFX_PMS_PMSIEN_UVC_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.UVC */
#define IFX_PMS_PMSIEN_UVC_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.UVC */
#define IFX_PMS_PMSIEN_UVC_OFF (5u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.OVPRE */
#define IFX_PMS_PMSIEN_OVPRE_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.OVPRE */
#define IFX_PMS_PMSIEN_OVPRE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.OVPRE */
#define IFX_PMS_PMSIEN_OVPRE_OFF (6u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.UVPRE */
#define IFX_PMS_PMSIEN_UVPRE_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.UVPRE */
#define IFX_PMS_PMSIEN_UVPRE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.UVPRE */
#define IFX_PMS_PMSIEN_UVPRE_OFF (7u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.OVDDM */
#define IFX_PMS_PMSIEN_OVDDM_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.OVDDM */
#define IFX_PMS_PMSIEN_OVDDM_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.OVDDM */
#define IFX_PMS_PMSIEN_OVDDM_OFF (8u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.UVDDM */
#define IFX_PMS_PMSIEN_UVDDM_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.UVDDM */
#define IFX_PMS_PMSIEN_UVDDM_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.UVDDM */
#define IFX_PMS_PMSIEN_UVDDM_OFF (9u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.OVSB */
#define IFX_PMS_PMSIEN_OVSB_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.OVSB */
#define IFX_PMS_PMSIEN_OVSB_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.OVSB */
#define IFX_PMS_PMSIEN_OVSB_OFF (10u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.UVSB */
#define IFX_PMS_PMSIEN_UVSB_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.UVSB */
#define IFX_PMS_PMSIEN_UVSB_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.UVSB */
#define IFX_PMS_PMSIEN_UVSB_OFF (11u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.EVRCMOD */
#define IFX_PMS_PMSIEN_EVRCMOD_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.EVRCMOD */
#define IFX_PMS_PMSIEN_EVRCMOD_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.EVRCMOD */
#define IFX_PMS_PMSIEN_EVRCMOD_OFF (16u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.SDVOK */
#define IFX_PMS_PMSIEN_SDVOK_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.SDVOK */
#define IFX_PMS_PMSIEN_SDVOK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.SDVOK */
#define IFX_PMS_PMSIEN_SDVOK_OFF (17u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.SYNCLCK */
#define IFX_PMS_PMSIEN_SYNCLCK_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.SYNCLCK */
#define IFX_PMS_PMSIEN_SYNCLCK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.SYNCLCK */
#define IFX_PMS_PMSIEN_SYNCLCK_OFF (18u)

/** \brief Length for Ifx_PMS_PMSIEN_Bits.SWDLVL */
#define IFX_PMS_PMSIEN_SWDLVL_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSIEN_Bits.SWDLVL */
#define IFX_PMS_PMSIEN_SWDLVL_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSIEN_Bits.SWDLVL */
#define IFX_PMS_PMSIEN_SWDLVL_OFF (19u)

