Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxPms_bf.h
/** \brief Length for Ifx_PMS_PMSWCR5_Bits.PORSTDF */
#define IFX_PMS_PMSWCR5_PORSTDF_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR5_Bits.PORSTDF */
#define IFX_PMS_PMSWCR5_PORSTDF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR5_Bits.PORSTDF */
#define IFX_PMS_PMSWCR5_PORSTDF_OFF (4u)

/** \brief Length for Ifx_PMS_PMSWCR5_Bits.DCDCSYNCO */
#define IFX_PMS_PMSWCR5_DCDCSYNCO_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWCR5_Bits.DCDCSYNCO */
#define IFX_PMS_PMSWCR5_DCDCSYNCO_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWCR5_Bits.DCDCSYNCO */
#define IFX_PMS_PMSWCR5_DCDCSYNCO_OFF (6u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_PMS_PMSWSTAT_HWCFGEVR_LEN (2u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_PMS_PMSWSTAT_HWCFGEVR_MSK (0x3u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_PMS_PMSWSTAT_HWCFGEVR_OFF (1u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.HWCFG4 */
#define IFX_PMS_PMSWSTAT_HWCFG4_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.HWCFG4 */
#define IFX_PMS_PMSWSTAT_HWCFG4_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.HWCFG4 */
#define IFX_PMS_PMSWSTAT_HWCFG4_OFF (4u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.HWCFG5 */
#define IFX_PMS_PMSWSTAT_HWCFG5_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.HWCFG5 */
#define IFX_PMS_PMSWSTAT_HWCFG5_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.HWCFG5 */
#define IFX_PMS_PMSWSTAT_HWCFG5_OFF (5u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.TRIST */
#define IFX_PMS_PMSWSTAT_TRIST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.TRIST */
#define IFX_PMS_PMSWSTAT_TRIST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.TRIST */
#define IFX_PMS_PMSWSTAT_TRIST_OFF (6u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.TESTMODE */
#define IFX_PMS_PMSWSTAT_TESTMODE_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.TESTMODE */
#define IFX_PMS_PMSWSTAT_TESTMODE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.TESTMODE */
#define IFX_PMS_PMSWSTAT_TESTMODE_OFF (7u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.ESR0TRIST */
#define IFX_PMS_PMSWSTAT_ESR0TRIST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.ESR0TRIST */
#define IFX_PMS_PMSWSTAT_ESR0TRIST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.ESR0TRIST */
#define IFX_PMS_PMSWSTAT_ESR0TRIST_OFF (8u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.PORSTDF */
#define IFX_PMS_PMSWSTAT_PORSTDF_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.PORSTDF */
#define IFX_PMS_PMSWSTAT_PORSTDF_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.PORSTDF */
#define IFX_PMS_PMSWSTAT_PORSTDF_OFF (11u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.SCR */
#define IFX_PMS_PMSWSTAT_SCR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.SCR */
#define IFX_PMS_PMSWSTAT_SCR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.SCR */
#define IFX_PMS_PMSWSTAT_SCR_OFF (16u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.SCRST */
#define IFX_PMS_PMSWSTAT_SCRST_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.SCRST */
#define IFX_PMS_PMSWSTAT_SCRST_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.SCRST */
#define IFX_PMS_PMSWSTAT_SCRST_OFF (17u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.SCRCLK */
#define IFX_PMS_PMSWSTAT_SCRCLK_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.SCRCLK */
#define IFX_PMS_PMSWSTAT_SCRCLK_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.SCRCLK */
#define IFX_PMS_PMSWSTAT_SCRCLK_OFF (18u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.PORSTREQ */
#define IFX_PMS_PMSWSTAT_PORSTREQ_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.PORSTREQ */
#define IFX_PMS_PMSWSTAT_PORSTREQ_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.PORSTREQ */
#define IFX_PMS_PMSWSTAT_PORSTREQ_OFF (19u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.WUTEN */
#define IFX_PMS_PMSWSTAT_WUTEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.WUTEN */
#define IFX_PMS_PMSWSTAT_WUTEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.WUTEN */
#define IFX_PMS_PMSWSTAT_WUTEN_OFF (24u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.WUTRUN */
#define IFX_PMS_PMSWSTAT_WUTRUN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.WUTRUN */
#define IFX_PMS_PMSWSTAT_WUTRUN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.WUTRUN */
#define IFX_PMS_PMSWSTAT_WUTRUN_OFF (25u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.WUTMODE */
#define IFX_PMS_PMSWSTAT_WUTMODE_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.WUTMODE */
#define IFX_PMS_PMSWSTAT_WUTMODE_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.WUTMODE */
#define IFX_PMS_PMSWSTAT_WUTMODE_OFF (26u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.ESR0INT */
#define IFX_PMS_PMSWSTAT_ESR0INT_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.ESR0INT */
#define IFX_PMS_PMSWSTAT_ESR0INT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.ESR0INT */
#define IFX_PMS_PMSWSTAT_ESR0INT_OFF (28u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.ESR1INT */
#define IFX_PMS_PMSWSTAT_ESR1INT_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.ESR1INT */
#define IFX_PMS_PMSWSTAT_ESR1INT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.ESR1INT */
#define IFX_PMS_PMSWSTAT_ESR1INT_OFF (29u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.PINAINT */
#define IFX_PMS_PMSWSTAT_PINAINT_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.PINAINT */
#define IFX_PMS_PMSWSTAT_PINAINT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.PINAINT */
#define IFX_PMS_PMSWSTAT_PINAINT_OFF (30u)

/** \brief Length for Ifx_PMS_PMSWSTAT_Bits.PINBINT */
#define IFX_PMS_PMSWSTAT_PINBINT_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT_Bits.PINBINT */
#define IFX_PMS_PMSWSTAT_PINBINT_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT_Bits.PINBINT */
#define IFX_PMS_PMSWSTAT_PINBINT_OFF (31u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.ESR0WKP */
#define IFX_PMS_PMSWSTAT2_ESR0WKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.ESR0WKP */
#define IFX_PMS_PMSWSTAT2_ESR0WKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.ESR0WKP */
#define IFX_PMS_PMSWSTAT2_ESR0WKP_OFF (0u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.ESR1WKP */
#define IFX_PMS_PMSWSTAT2_ESR1WKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.ESR1WKP */
#define IFX_PMS_PMSWSTAT2_ESR1WKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.ESR1WKP */
#define IFX_PMS_PMSWSTAT2_ESR1WKP_OFF (1u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PINAWKP */
#define IFX_PMS_PMSWSTAT2_PINAWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PINAWKP */
#define IFX_PMS_PMSWSTAT2_PINAWKP_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PINAWKP */
#define IFX_PMS_PMSWSTAT2_PINAWKP_OFF (2u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PINBWKP */
#define IFX_PMS_PMSWSTAT2_PINBWKP_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PINBWKP */
#define IFX_PMS_PMSWSTAT2_PINBWKP_MSK (0x1u)

