Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxPms_bf.h
/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PWRWKEN */
#define IFX_PMS_PMSWSTAT2_PWRWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PWRWKEN */
#define IFX_PMS_PMSWSTAT2_PWRWKEN_OFF (28u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.SCRWKEN */
#define IFX_PMS_PMSWSTAT2_SCRWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.SCRWKEN */
#define IFX_PMS_PMSWSTAT2_SCRWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.SCRWKEN */
#define IFX_PMS_PMSWSTAT2_SCRWKEN_OFF (29u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.PORSTWKEN */
#define IFX_PMS_PMSWSTAT2_PORSTWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.PORSTWKEN */
#define IFX_PMS_PMSWSTAT2_PORSTWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.PORSTWKEN */
#define IFX_PMS_PMSWSTAT2_PORSTWKEN_OFF (30u)

/** \brief Length for Ifx_PMS_PMSWSTAT2_Bits.WUTWKEN */
#define IFX_PMS_PMSWSTAT2_WUTWKEN_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTAT2_Bits.WUTWKEN */
#define IFX_PMS_PMSWSTAT2_WUTWKEN_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTAT2_Bits.WUTWKEN */
#define IFX_PMS_PMSWSTAT2_WUTWKEN_OFF (31u)

/** \brief Length for Ifx_PMS_PMSWUTCNT_Bits.WUTCNT */
#define IFX_PMS_PMSWUTCNT_WUTCNT_LEN (24u)

/** \brief Mask for Ifx_PMS_PMSWUTCNT_Bits.WUTCNT */
#define IFX_PMS_PMSWUTCNT_WUTCNT_MSK (0xffffffu)

/** \brief Offset for Ifx_PMS_PMSWUTCNT_Bits.WUTCNT */
#define IFX_PMS_PMSWUTCNT_WUTCNT_OFF (0u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.ESR0WKPCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0WKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.ESR0WKPCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0WKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.ESR0WKPCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0WKPCLR_OFF (0u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.ESR1WKPCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1WKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.ESR1WKPCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1WKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.ESR1WKPCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1WKPCLR_OFF (1u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PINAWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PINAWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PINAWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PINAWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PINAWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PINAWKPCLR_OFF (2u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PINBWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PINBWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PINBWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PINBWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PINBWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PINBWKPCLR_OFF (3u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PWRWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PWRWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PWRWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PWRWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PWRWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PWRWKPCLR_OFF (4u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.SCRWKPCLR */
#define IFX_PMS_PMSWSTATCLR_SCRWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.SCRWKPCLR */
#define IFX_PMS_PMSWSTATCLR_SCRWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.SCRWKPCLR */
#define IFX_PMS_PMSWSTATCLR_SCRWKPCLR_OFF (5u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PORSTWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PORSTWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PORSTWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PORSTWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PORSTWKPCLR */
#define IFX_PMS_PMSWSTATCLR_PORSTWKPCLR_OFF (6u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.WUTWKPCLR */
#define IFX_PMS_PMSWSTATCLR_WUTWKPCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.WUTWKPCLR */
#define IFX_PMS_PMSWSTATCLR_WUTWKPCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.WUTWKPCLR */
#define IFX_PMS_PMSWSTATCLR_WUTWKPCLR_OFF (7u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.ESR0OVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0OVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.ESR0OVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0OVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.ESR0OVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0OVRUNCLR_OFF (8u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.ESR1OVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1OVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.ESR1OVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1OVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.ESR1OVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1OVRUNCLR_OFF (9u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PINAOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PINAOVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PINAOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PINAOVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PINAOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PINAOVRUNCLR_OFF (10u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PINBOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PINBOVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PINBOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PINBOVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PINBOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PINBOVRUNCLR_OFF (11u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.SCROVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_SCROVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.SCROVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_SCROVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.SCROVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_SCROVRUNCLR_OFF (13u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.PORSTOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PORSTOVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.PORSTOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PORSTOVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.PORSTOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_PORSTOVRUNCLR_OFF (14u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.WUTOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_WUTOVRUNCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.WUTOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_WUTOVRUNCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.WUTOVRUNCLR */
#define IFX_PMS_PMSWSTATCLR_WUTOVRUNCLR_OFF (15u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.SCRSTCLR */
#define IFX_PMS_PMSWSTATCLR_SCRSTCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.SCRSTCLR */
#define IFX_PMS_PMSWSTATCLR_SCRSTCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.SCRSTCLR */
#define IFX_PMS_PMSWSTATCLR_SCRSTCLR_OFF (16u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.ESR0INTCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0INTCLR_LEN (1u)

/** \brief Mask for Ifx_PMS_PMSWSTATCLR_Bits.ESR0INTCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0INTCLR_MSK (0x1u)

/** \brief Offset for Ifx_PMS_PMSWSTATCLR_Bits.ESR0INTCLR */
#define IFX_PMS_PMSWSTATCLR_ESR0INTCLR_OFF (28u)

/** \brief Length for Ifx_PMS_PMSWSTATCLR_Bits.ESR1INTCLR */
#define IFX_PMS_PMSWSTATCLR_ESR1INTCLR_LEN (1u)

